/********************************************************************************************************
* 文件名：SysTick.h                                                                                     *
* 编写人: 离逝的风   									                                                                  *
* 更新时间:2018.9.22									                                                                  *
* 地点：xx									                                                                            *
* 说明：此文件属于开源，所有权对任何人开放					                                                  	*
*													                                                                              *
* 系统时钟定时配置步骤如下:										                                                          *
* 1.调用core_m3.h文件中的SysTick_Config()函数,此函数参数为(LOAD)装载值,默认失踪为AHB时钟(72M),          *
*  [注意：此值不宜太小]此函数返回1表示失败,返回0表示成功					                                      *
* 2.添加中断服务函数											                                                              *
* 备注:若搭载了操作系统，那系统定时器谨慎使用，建议不使用				                                        *
*********************************************************************************************************/
#ifndef   __SYSTICK_H_
#define   __SYSTICK_H_

#include "stm32f10x.h"

/************************************************************************
函数名：SysTick_Handler
参数：无
返回值：无
功能：滴答定时器中断
备注：一般无需调用此函数
************************************************************************/
void SysTick_Handler(void);

/************************************************************************
函数名：Systick_Init
参数：无
返回值：无
功能：滴答定时器初始化
************************************************************************/
void Systick_Init(void);

/************************************************************************
函数名：SysDelay_10us
参数：无
返回值：无
功能：延时10us
************************************************************************/
void SysDelay_10us(void);     


/************************************************************************
函数名：SysDelay_ms
参数：延时毫秒个数
返回值：无
功能：延时ms级别
备注：例如延时10ms，SysDelay_ms(10);
************************************************************************/
void SysDelay_ms(unsigned int ms);       

/************************************************************************
函数名：SysDelay_s
参数：延时秒个数
返回值：无
功能：延时s级别
备注：例如延时10s，SysDelay_s(10);
************************************************************************/
void SysDelay_s(unsigned int s);          




#endif


