/**************************************************************************
* 文件名：DAC.h                                                           *
* 编写人：离逝的风                                                        *
* 更新时间：2018.12.11                                                    *
* 说明：此文件属于开源，所有权对任何人开放					                     	*
* 如有问题请联系邮箱：1477153217@qq.com                                   *
* 使用步骤：                                                              *
* 1.开启DACx_EN设置为1                                                    *
* 2.设置通道触发方式，即设置DAC1_TR                                       *
* 3.设置DAC数据长度                                                       *
* 4.设置TIM触发时间                                                       *
* 5.在主函数中初始化DAC，即调用DACx_Init                                  *
* 说明：输出频率由DAC1_TIM_PSC和DAC2_TIM_ARR决定                          *
***************************************************************************/
#ifndef  _DAC_H_
#define  _DAC_H_

#include "stm32f10x.h"
/*#####################################引脚说明################################################*/
//#                       DAC1_OUT  -----------  GPIOA4                                        #/
//#                       DAC2_OUT  -----------  GPIOA5                                        #/
//##############################################################################################/


/*#####################################下面为DAC通道的开关#####################################*/
// 0:开启        1:关闭
#define           DAC1_EN         1
#define           DAC2_EN         0


/*#####################################选择触发方式############################################*/
//0:TIM6      1:TIM7 

#define          DAC1_TR          0
#define          DAC2_TR          0

/*#####################################设置数据来源长度########################################*/
#define          DAC1_Lenth       63
#define          DAC2_Lenth       1

/*#####################################设置定时器触发时间#####################################*/
//定时器分频系数
#define          DAC1_TIM_PSC      1
#define          DAC2_TIM_PSC      1
//定时器重装值
#define          DAC1_TIM_ARR      4000
#define          DAC2_TIM_ARR      10

/*######################################下面为DAC数字量数据来源################################*/
extern unsigned int DAC1_DATE[DAC1_Lenth];
extern unsigned int DAC2_DATE[DAC2_Lenth];

/*######################################下面为DAC接口函数#####################################*/
/************************************************************
函数：DAC1_Init
参数：无
返回值：无
说明：初始化DAC1
*************************************************************/
void DAC1_Init(void);
	
/************************************************************
函数：DAC2_Init
参数：无
返回值：无
说明：初始化DAC2
*************************************************************/
void DAC2_Init(void);

#endif

//FILE END

